Revit 2017 API
StructuralSection Properties
The StructuralSection type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SectionNameKey
 A parameter in structural families which allows for family type identification. This will be used for data mapping during model exchange with another program, namely Advance Steel.
StructuralSectionShape
 The type of structural section shape.
StructuralSectionShapeName
 A human readable string representing the structural section shape.
See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace